benchmark-results/14-db-comparison-local-20260328/Oracle-SingleSelect_c10_180s_wrk.txt
Running 3m test @ http://localhost:8891/api/oracle/user/1
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   761.04us    3.14ms 180.54ms   99.79%
    Req/Sec     3.07k   260.95     3.43k    86.74%
  Latency Distribution
     50%  604.00us
     75%  656.00us
     90%  759.00us
     99%    2.16ms
  2200175 requests in 3.00m, 709.21MB read
Requests/sec:  12222.76
Transfer/sec:      3.94MB